{
  "order": "1",
  "isPrivate": false,
  "title": "Bridal Forest",
  "description": "Interactive in-store installation for Boucheron",
  "featuredMedia": {
    "image": "/projects/Bridal Forest/Random Studio Boucheron Ginza2.jpeg"
  },
  "year": "2023",
  "tags": [
    "UI/UX Design",
    "Concept Development",
    "Art Direction",
    "Prototyping"
  ],
  "credits": "As part of Random Studio for Boucheron",
  "lede": "<p>As a member of the Experience Design team at Random Studio, I contributed to the creation of nature-themed digital intervention for Boucheron's flagship store in Ginza, Japan.</p>",
  "blocks": [
    {
      "text": {
        "heading": "Insight",
        "text": "Upon joining the project, our team was tasked to infuse emotional depth into the shopping experience at the brand's new flagship store, particularly focusing on elevating the purchase of a wedding ring into a memorable moment for customers."
      },
      "visuals": [
        {
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "Idea",
        "text": "The Bridal Forest is an interactive installation that exists as a poetic blend of tradition and technology. Inspired by the Japanese Tanabata tradition, it offers couples a unique ritual as they choose their wedding rings. "
      },
      "visuals": [
        {
          "media": {
            "image": "/projects/Bridal Forest/Random Studio Boucheron Ginza4.png"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "text": "The Wishing Tree invites couples to write their wishes, casting them onto a physical birch with a simple gesture – ‘tying the knot’, that forges a lasting memory of a couple obtaining their Boucheron wedding bands. "
      },
      "visuals": [
        {
          "media": {
            "image": "/projects/Rectangle 75.png"
          },
          "caption": "The Wishing Tree invites couples to write their wishes, casting them onto a physical birch with a simple gesture – ‘tying the knot’, that forges a lasting memory of a couple obtaining their Boucheron wedding bands. ",
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "Process",
        "text": "Rather than seeking alignment on fully developed concepts we ideated quickly, tested ideas, validated the concepts with hotel's guests, and delivered rapid prototypes to determine the potential of an idea. The final insights and concept demos were shared with the client as part of the creative board meetings."
      },
      "visuals": [
        {
          "width": 100,
          "marginLeft": 0
        }
      ]
    }
  ]
}