{
  "order": 8,
  "isPrivate": true,
  "title": "about : blank",
  "description": "R&D for an interactive livestream shopping setup",
  "featuredMedia": {
    "image": "/media/Doyin/heroimage-doyin.png"
  },
  "year": "2023",
  "tags": [
    "Concept Design",
    "R&D",
    "Prototyping",
    "User Experience"
  ],
  "credits": "As part of Random Studio for Zara",
  "lede": "Leveraging Douyin platform for high-impact fashion marketing, blending entertainment, interactivity, and e-commerce in a captivating way.",
  "blocks": [
    {
      "text": {
        "heading": "Insight",
        "text": "Zara is poised to revolutionize the fashion industry once again, this time through pioneering experimentation in the realm of livestream e-commerce.  Recognizing the potential of this new frontier, our team was tasked to create a dynamic scenography tailored for Doyin platform."
      },
      "visuals": [
        {
          "media": {
            "image": "/media/Doyin/Doyin-diagram.svg"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "Idea",
        "text": "We see Zara Douyin as an extension of Zara's existing e-commerce, and as such it should live in the same world, the world of the screen. Whatever space we design should remain fresh, with flexibility and reactiveness being at the core of its concept — a fully programmable space. "
      },
      "visuals": [
        {
          "media": {
            "image": "/media/Doyin/screens-diagram.png"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "text": "In contrast to traditional setups demanding a sizable crew working long hours, seven days a week, we tried to bring randomness of automation to the core of the concept. Employing clothing detection algorithms, dynamic cameras, and responsive scenography, Zara should achieve unprecedented flexibility for seasonal updates and generate captivating real-time content, even for extended daily durations."
      },
      "visuals": [
        {
          "media": {
            "image": "/media/Doyin/doyin-algorithm.png"
          },
          "width": 80,
          "marginLeft": 10
        }
      ]
    },
    {
      "text": {
        "text": "Drawing inspiration from about:blank, which is emblematic of the internet's infinite possibilities and serves as a blank canvas, this colon becomes the horizon of our dynamic backdrops, the platform upon which our hosts stand, the visual representation of 'loading' lights, and even mirrors the form of the infinity cove itself, thus unifying and harmonizing the elements into a cohesive whole."
      },
      "visuals": [
        {
          "media": {
            "video": "fef442f3-a117-4ad4-8016-236f05bf0e8b"
          },
          "caption": "01 Garment In",
          "width": 100,
          "marginLeft": 0
        },
        {
          "media": {
            "video": "4a162126-8915-4bbc-9c1e-63f31f97858b"
          },
          "caption": "02 Product Close-up",
          "width": 100,
          "marginLeft": 0
        },
        {
          "media": {
            "video": "8d152693-7b76-4d54-a4a3-556eea520912"
          },
          "caption": "03 XR Stage",
          "width": 100,
          "marginLeft": 0
        },
        {
          "media": {
            "video": "bb0ee388-f2c9-47fe-bda0-4e1ed888d9a2"
          },
          "caption": "04 Host Transition",
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "End Result",
        "text": "By ideating and prototyping we established the framework for the space to be transformed through lighting changes and generated backgrounds based on the garments that the hosts are wearing. The initial pilot is centred on exploring diverse coloured environments, serving as a testing ground for future experiments."
      },
      "visuals": [
        {
          "media": {
            "image": "/media/Doyin/doying-space.png"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "text": "We have developed a very early prototype of the garment detection system, in which computer vision ‘sees’ the different garments worn by any individual on set, and automatically generates different scenography based upon this data. This can be further extended into a smarter system that sees not only colours but other attributes of the clothing."
      },
      "visuals": [
        {
          "media": {
            "video": "6a48737a-ff42-48fd-9155-e4a22a445a05"
          },
          "width": 60,
          "marginLeft": 20
        }
      ]
    },
    {
      "text": {
        "heading": "Process",
        "text": "We created an exact digital copy of the livestream within Unreal, a real-time game engine which gives us the ability to rapidly prototype and assess the feasibility of different shots and lighting set ups."
      },
      "visuals": [
        {
          "media": {
            "video": "c6564ac2-5729-49fb-b367-2ee247c01ea3"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    }
  ]
}