{
  "order": "1",
  "isPrivate": true,
  "title": "Store of the Future",
  "description": "In-store digital selling platform",
  "media": {
    "image": "/projects/A53f5e5fa274429c1dd2229a9acbeff3 (1).png",
    "video": "5e411680-14fe-4df5-aed4-1a5369f34c89"
  },
  "year": "2023",
  "tags": [
    "UI/UX Design",
    "Concept Development",
    "Art Direction",
    "Prototyping"
  ],
  "credits": "As part of Random Studio for Boucheron",
  "lede": "As a member of the Experience Design team at Random Studio, I contributed to the creation of nature-themed digital intervention for Boucheron's flagship store in Ginza, Japan. ",
  "blocks": [
    {
      "text": {
        "heading": "Insight",
        "text": "A memorable hotel stay typically promises luxury, but how can we elevate it to offer a real wellness experience with citizenM's light-hearted and humorous attitude towards standard hospitality 'promises'?"
      },
      "images": [
        {
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "Idea",
        "text": "When our team at Random Studio took on the challenge of redefining hotel experience for citizenM, we aimed to enhance their room's inherent strengths to provide value beyond existing apps and travel gadgets. "
      },
      "images": [
        {
          "image": "/projects/Portfolio External (1).png",
          "width": 66,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "End Result",
        "text": "The result is a  personalised collection of well-being moments catered towards alleviating travel fatigue. These moments are complimentary with a citizenM room and can be accessed through the app. Each moment is has its own distinctive scenography, which is brought to life within the physical space of the room."
      },
      "images": [
        {
          "image": "/projects/Milan-03 3.png",
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "Process",
        "text": "Rather than seeking alignment on fully developed concepts we ideated quickly, tested ideas, validated the concepts with hotel's guests, and delivered rapid prototypes to determine the potential of an idea. The final insights and concept demos were shared with the client as part of the creative board meetings."
      },
      "images": [
        {
          "width": 100,
          "marginLeft": 0
        }
      ]
    }
  ]
}