{
  "order": 2,
  "isPrivate": false,
  "title": "Store of the Future",
  "description": "In-store digital selling platform",
  "featuredMedia": {
    "image": "/media/S&A/sa-cover.png"
  },
  "year": "2022–2024",
  "tags": [
    "UI/UX Design",
    "CX Design",
    "User Research",
    "Product Strategy",
    "Design Systems"
  ],
  "credits": "As part of Random Studio (client NDA)",
  "lede": "2+ years of continuous discovery, design, and launch of the new features for a global digital retail platform that spans 350+ stores in Europe.",
  "blocks": [
    {
      "text": {
        "heading": "Insight",
        "text": "The pandemic has accelerated the shift to digital shopping, yet stores continue to be a crucial part of the omnichannel consumer journey. In a retail environment where clients often arrive with specific requests after browsing online, store associates need efficient tools to effectively turn conversations into successful sales interactions."
      },
      "visuals": [
        {
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "Idea",
        "text": "Since joining as a Digital Experience designer, I've been part of The Store of the Future program, an innovation initiative that has played a key role in keeping the client at the forefront of integrating digital tools into physical stores. Our focus shifted from customer-facing interfaces to empowering store associates across the retail journey, ranging from shop floor automation to RFID integration, to loyalty program development."
      },
      "visuals": [
        {
          "media": {
            "video": "e8ab8861-3572-49b8-ad4d-1760333fb5b6"
          },
          "width": 100,
          "marginLeft": 0
        },
        {
          "media": {
            "video": "134fdd8a-8c1d-4302-bc01-153fc2a4f436"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "End Result",
        "text": "The multi-device platform allows the store associates to quickly find requested items, check inventory stock, provide product information & styling advice, and assist customers in placing online orders if the desired product is not available in-store."
      },
      "visuals": [
        {
          "media": {
            "video": "3bcfbafe-2a75-4a75-899b-75b5d56185ef"
          },
          "width": 100,
          "marginLeft": 40
        }
      ]
    },
    {
      "text": {
        "text": "The resulting product, now in daily use by store associates, saves them 2 hours each day in locating requested items. The recent integration of the Stock Request feature has effectively reduced errors and the time required for "
      },
      "visuals": [
        {
          "media": {
            "video": "4ac43bee-47b9-4cab-9a39-486b02048172"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "text": "The resulting product, now in daily use by store associates, saves them 2 hours each day in locating requested items. The recent integration of the Stock Request feature has effectively reduced errors and the time required for requesting items from the stockroom, enabling store associates to allocate more time to the shop floor."
      },
      "visuals": [
        {
          "media": {
            "image": "/media/S&A/Frame 463.svg"
          },
          "width": 100,
          "marginLeft": 0
        },
        {
          "media": {
            "image": "/media/S&A/Frame 464.svg"
          },
          "width": 100,
          "marginLeft": 0
        },
        {
          "media": {
            "image": "/media/S&A/Frame 465.svg"
          },
          "width": 100,
          "marginLeft": 0
        },
        {
          "media": {
            "image": "/media/S&A/Frame 466.svg"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    },
    {
      "text": {
        "heading": "Process",
        "text": "As part of Random's in-house digital retail team, I have been fully involved in all stages of the project – from ideation workshops and user research  to executing UI/UX design initiatives, collaborating with stakeholders, and leading the major update of the platform’s multi-brand design system."
      },
      "visuals": [
        {
          "media": {
            "image": "/media/S&A/2266312.png"
          },
          "width": 100,
          "marginLeft": 0
        }
      ]
    }
  ]
}